app/controllers/api/users_controller.rb

  def show
    @user = User.includes(:videos, :liked_videos).find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]