app/controllers/api/videos_controller.rb

  def index
    @videos = Video.includes(:user, :likes).search_videos(params)
---
SELECT "videos".* FROM "videos"

  def show
    @video = Video.includes(likes: [:user, :video], comments: [:user]).find(params[:id])
    if @video
      @video.views += 1
      @video.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "videos" SET "views" = $1, "updated_at" = $2 WHERE "videos"."id" = $3  [["views", 74924], ["updated_at", "2017-02-17 17:03:24.940889"], ["id", 6]]