app/views/api/users/_user.json.jbuilder

SELECT "videos".* FROM "videos"
---

json.video_count user.videos.length